run/cyclicBC_debug_case2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoModiFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.1;

writeControl    timeStep; //adjustable;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// adjustTimeStep  yes;
adjustTimeStep  no;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       1;

maxCapillaryNum 1e8;
/*
 libs
 (
     "libtwoPhaseProperties.so"
 );

 functions
 {

     reconSurfaces
     {
         type            surfaces;
         libs            ("libpostProcess.so");
         writeControl    adjustableRunTime;
         writeInterval   1e-2;

         surfaceFormat   raw;
         fields          (K_ alpha.water);

         interpolationScheme cell;

         surfaces
         (

             freeSurf
             {
                 type            interface;
                 interpolate     false;
             }

         );
     }
 }*/

#include "FO_PLICInterface"
// #include "FO_runTime"
// ************************************************************************* //
